app/Controllers/Admin.php

    public function index() {
        $contentModel = new ContentModel;
        $pageModel = new PagesModel;
        $userModel = new UserModel;

        $totalContent = $contentModel->countAllResults();
        $totalPage = $pageModel->countAllResults();
        $totalUser = $userModel->countAllResults();
        $user  = $userModel->findAll();
        $user_active = $userModel->where("active","1")->countAllResults();
        $totalS_A = $contentModel->where("content_section","Section-A")->countAllResults();
        $totalS_B = $contentModel->where("content_section","Section-B")->countAllResults();
        $totalS_C = $contentModel->where("content_section","Section-C")->countAllResults();
        $totalS_D = $contentModel->where("content_section","Section-D")->countAllResults();
        $totalS_E = $contentModel->where("content_section","Section-E")->countAllResults();
---
SELECT COUNT(*) AS `numrows`
FROM `contents`
SELECT COUNT(*) AS `numrows`
FROM `pages`
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT *
FROM `users`
WHERE `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `users`
WHERE `active` = '1'
AND `users`.`deleted_at` IS NULL
SELECT COUNT(*) AS `numrows`
FROM `contents`
WHERE `content_section` = 'Section-A'
SELECT COUNT(*) AS `numrows`
FROM `contents`
WHERE `content_section` = 'Section-B'
SELECT COUNT(*) AS `numrows`
FROM `contents`
WHERE `content_section` = 'Section-C'
SELECT COUNT(*) AS `numrows`
FROM `contents`
WHERE `content_section` = 'Section-D'
SELECT COUNT(*) AS `numrows`
FROM `contents`
WHERE `content_section` = 'Section-E'