app/Controllers/Content.php

    public function index()
    {
        $pagemodel = new PagesModel;
        $pages = $pagemodel->findAll();
---
SELECT *
FROM `pages`

    public function show()
    {
        $contentmodel = new ContentModel();
        $pagemodel = new PagesModel();
        $pages = $pagemodel->findAll();



        $pager = \Config\Services::pager();
        $perPage = 10;
        $search = $this->request->getVar('search');

        if (!empty($search)) {
            $contents = $contentmodel->searchContent($search, $perPage);
        } else {
            $contents = $contentmodel->paginate($perPage);
---
SELECT *
FROM `contents`