app/Controllers/Home.php

    public function index()
    {

        $contents = $this->contentmodel->findAll();
        $pages = $this->pagemodel->findAll();
        $page = $this->pagemodel->findAll();
---
SELECT *
FROM `contents`
SELECT *
FROM `pages`

    public function homes()
    {

        $contents = $this->contentmodel->findAll();
        $pages = $this->pagemodel->findAll();
---
SELECT *
FROM `contents`
SELECT *
FROM `pages`

    public function menu()
    {
        $contents = $this->contentmodel->findAll();
        $burgers = $this->burgername->findAll();
        $pages = $this->pagemodel->findAll();
---
SELECT *
FROM `contents`
SELECT *
FROM `pages`