app/Controllers/Login.php

SELECT *
FROM `pages`
---
    public function index()
    {
        $users = new UserModel();
        $pagemodel = new PagesModel();

        $user = auth()->user();
        if (auth()->loggedIn()) {

            $session = session();
            $session->set('isLoggedIn', true);


            $session->set('user_id', $user->id);
            $session->set('role', $user->role);
            return redirect()->to(base_url('/homes'));
        } else {

        }
        $pages = $pagemodel->findAll();