app/Models/ContentModel.php

public function getSectionA(){
    return $this->where("content_section", "Section-A")->findAll();
---
SELECT *
FROM `contents`
WHERE `content_section` = 'Section-A'

public function getSectionB(){
    return $this->where("content_section", "Section-B")->findAll();
}public function getSectionC(){
    return $this->where("content_section", "Section-C")->findAll();
}public function getSectionD(){
    return $this->where("content_section", "Section-D")->findAll();
}public function getSectionE(){
    return $this->where("content_section", "Section-E")->findAll();
---
SELECT *
FROM `contents`
WHERE `content_section` = 'Section-B'
SELECT *
FROM `contents`
WHERE `content_section` = 'Section-C'